% Программа P1_5
% Сглаживание сигнала путём усреднения
clf;
R=51;
d=0.8*(rand(R,1)-0.5); % Генерация случайного шума
m=0:R-1;
s=2*m.*(0.9.^m); % Генерация чистого сигнала
x=s+d'; % Генерация искажённого шумом сигнала

subplot(2,1,1);
% вывод массива линий состоящий из переменных x,y,type 
plot(m,d','r-',m,s,'g--',m,x,'b-.');
xlabel('Время n'); ylabel('Амплитуда');
legend('d[n] ','s[n] ','x[n] ');
x1=[0 0 x]; x2=[0 x 0]; x3=[x 0 0];
y=(x1+x2+x3)/3;
subplot(2,1,2);
plot(m,y(2:R+1),'r-',m,s,'b--');
legend('y[n] ','s[n] ');
xlabel('Время n'); ylabel('Амплитуда');
